docs/cs240/KBhCS240ThreatModeling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 08:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Threat Modeling</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Houjun Liu" />
<link rel="stylesheet" href="../global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Threat Modeling</h1>

<div id="outline-container-org3428107" class="outline-2">
<h2 id="org3428107"><span class="section-number-2">1</span> Previously, on Computer Security</h2>
<div class="outline-text-2" id="text-1">
<p>
How <i>do</i> we protect user data?
</p>

<p>
<b><b>Increased security always comes with a trade-off of ease of use.</b></b>
</p>
</div>

<div id="outline-container-orga22aa8a" class="outline-3">
<h3 id="orga22aa8a"><span class="section-number-3">1.1</span> Lessons from the number game</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Security is hard :(</li>
<li>Security is hard; uncertainty of security makes it harder</li>
<li>Its easier to brainstorm attacks than to brainstorm solutions</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org99eadfb" class="outline-2">
<h2 id="org99eadfb"><span class="section-number-2">2</span> Threat Modeling</h2>
<div class="outline-text-2" id="text-2">
<p>
Thread modeling is a fancy way of creating a structured brainstorming framework.
</p>
</div>

<div id="outline-container-org50c9f65" class="outline-3">
<h3 id="org50c9f65"><span class="section-number-3">2.1</span> Seven Questions to Threat Modeling</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Specifically, what are we protecting?</li>
<li>Who are we protecting it from, and what are their motivations?</li>
<li>What methods of attack do we prevent? What are types of attacks that we don't prevent?</li>
<li>What are the possible effects of these attacks? ("What types of attacks do we prevent, and how does that play on what we are protecting?")</li>
<li>What are the resources of attackers?</li>
<li>What are our resources?</li>
<li>What should we do?</li>
</ul>
</div>
</div>

<div id="outline-container-orgf20e2c7" class="outline-3">
<h3 id="orgf20e2c7"><span class="section-number-3">2.2</span> Actual Threat Modeling for Facebook Health Communities</h3>
<div class="outline-text-3" id="text-2-2">
<p>
&#x2026;that Wes did.
</p>
</div>

<div id="outline-container-orgcd6cd99" class="outline-4">
<h4 id="orgcd6cd99"><span class="section-number-4">2.2.1</span> What are we protecting?</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Health Communities use Facebook Groups to connect people around the world who have share health conditions. These groups are created and run by Facebook users and offer emotional support and information.
</p>

<p>
Goal is to protect the users of these groups from physical and emotional harm.
</p>

<p>
Goal is <i>not</i> protecting Facebook itself.
</p>
</div>
</div>

<div id="outline-container-orge8b8bad" class="outline-4">
<h4 id="orge8b8bad"><span class="section-number-4">2.2.2</span> Who are we protecting it from, and what are their motivations?</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="org9367b12"></a>Protecting From&#x2026;<br />
<div class="outline-text-5" id="text-2-2-2-1">
<ul class="org-ul">
<li>Profiteers who are looking to exploit vulnerable populations (e.g. scam artists, quacks)</li>
<li>Well-meaning but misinformed users</li>
<li>Trolls trying to get emotional reactions for funzies</li>
<li>Insurance companies who might change user premiums</li>
</ul>
</div>
</li>

<li><a id="org67c91ab"></a>Not Protecting From&#x2026;<br />
<div class="outline-text-5" id="text-2-2-2-2">
<ul class="org-ul">
<li>Facebook employees</li>
<li>Hackers who are not Facebook users (i.e. national states)</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb387b56" class="outline-4">
<h4 id="orgb387b56"><span class="section-number-4">2.2.3</span> What methods of attacks do we prevent?</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Selling or trading drugs/equipment on Facebook</li>
<li>Misinformation, either malicious or well-intentioned, that leads to physical harm</li>
<li>Bullying</li>
<li>Privacy leaks: somehow, someone's data from these groups leaks:
<ul class="org-ul">
<li>By malicious actors&#x2026;</li>
<li>By Facebook itself&#x2026;</li>
<li>By users themselves&#x2026;</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb4d254" class="outline-4">
<h4 id="orgeb4d254"><span class="section-number-4">2.2.4</span> What are the possible effects of these attacks?</h4>
<div class="outline-text-4" id="text-2-2-4">
<ol class="org-ol">
<li>Physical harm to users</li>
<li>Loss of trust in the platform (Facebook)</li>
</ol>
</div>
</div>

<div id="outline-container-org53ef55f" class="outline-4">
<h4 id="org53ef55f"><span class="section-number-4">2.2.5</span> What are their resources of the attackers?</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Believe that attackers' resources are limited:
</p>

<ul class="org-ul">
<li>Profiteers will only spend resources if the reward is worth it, so very little</li>
<li>Well-meaning users will spend little resources, or none if educated</li>
<li>Trolls will find an easier target to attack</li>
<li>Insurance companies are a question mark: lots of resources for high reward</li>
</ul>
</div>
</div>

<div id="outline-container-org407b0ab" class="outline-4">
<h4 id="org407b0ab"><span class="section-number-4">2.2.6</span> What are our resources?</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
Surprisingly limited, in some cases:
</p>

<ul class="org-ul">
<li>3 engineers, no PM, and half a data scientist</li>
<li>No medical experiences</li>
</ul>

<p>
But surprisingly large:
</p>

<ul class="org-ul">
<li>Multi-bullion dollar company</li>
<li>Dedicated security, misinformation, bullying, and illegal sales teams</li>
<li>Secret weapons: group admins and a direct line to Mark Zuckerberg</li>
</ul>
</div>
</div>

<div id="outline-container-org9d5b2f2" class="outline-4">
<h4 id="org9d5b2f2"><span class="section-number-4">2.2.7</span> What should we do?</h4>
<div class="outline-text-4" id="text-2-2-7">
<ol class="org-ol">
<li>Align closely with the Groups team as a whole</li>
<li>Partner with dedicated teams</li>
<li>Build/own ONLY the things that the group specifically care about
<ol class="org-ol">
<li>Sellling =&gt; Illegal Sales Team</li>
<li>Misinformation =&gt; Misinformation Team</li>
<li>Bullying =&gt; Well-being Team</li>
<li>Privacy&#x2026; a point of focus</li>
</ol></li>
</ol>

<p>
Hence, the first feature is allowing real-name users to post anonymously.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Houjun Liu</span><span class="date">2021-09-11 Sat 08:10</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
