docs/cs/computer_security/KBhCS240ThreatModeling.tex
% Created 2021-09-11 Sat 16:41
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Houjun Liu}
\date{\today}
\title{Threat Modeling}
\hypersetup{
 pdfauthor={Houjun Liu},
 pdftitle={Threat Modeling},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Previously, on Computer Security}
\label{sec:org926f91f}
How \emph{do} we protect user data?

\textbf{\textbf{Increased security always comes with a trade-off of ease of use.}}

\subsection{Lessons from the number game}
\label{sec:orgc68cbcc}
\begin{itemize}
\item Security is hard :(
\item Security is hard; uncertainty of security makes it harder
\item Its easier to brainstorm attacks than to brainstorm solutions
\end{itemize}

\section{Threat Modeling}
\label{sec:orgff84a51}
Thread modeling is a fancy way of creating a structured brainstorming framework.

\subsection{Seven Questions to Threat Modeling}
\label{sec:org98c4b0e}
\begin{itemize}
\item Specifically, what are we protecting?
\item Who are we protecting it from, and what are their motivations?
\item What methods of attack do we prevent? What are types of attacks that we don't prevent?
\item What are the possible effects of these attacks? ("What types of attacks do we prevent, and how does that play on what we are protecting?")
\item What are the resources of attackers?
\item What are our resources?
\item What should we do?
\end{itemize}

\subsection{Actual Threat Modeling for Facebook Health Communities}
\label{sec:org714a800}
\ldots{}that Wes did.

\subsubsection{What are we protecting?}
\label{sec:orgf570302}
Health Communities use Facebook Groups to connect people around the world who have share health conditions. These groups are created and run by Facebook users and offer emotional support and information.

Goal is to protect the users of these groups from physical and emotional harm.

Goal is \emph{not} protecting Facebook itself.

\subsubsection{Who are we protecting it from, and what are their motivations?}
\label{sec:org929d496}

\begin{enumerate}
\item Protecting From\ldots{}
\label{sec:org27f21c7}
\begin{itemize}
\item Profiteers who are looking to exploit vulnerable populations (e.g. scam artists, quacks)
\item Well-meaning but misinformed users
\item Trolls trying to get emotional reactions for funzies
\item Insurance companies who might change user premiums
\end{itemize}

\item Not Protecting From\ldots{}
\label{sec:orgc2e2e51}
\begin{itemize}
\item Facebook employees
\item Hackers who are not Facebook users (i.e. national states)
\end{itemize}
\end{enumerate}

\subsubsection{What methods of attacks do we prevent?}
\label{sec:org549bf5c}
\begin{itemize}
\item Selling or trading drugs/equipment on Facebook
\item Misinformation, either malicious or well-intentioned, that leads to physical harm
\item Bullying
\item Privacy leaks: somehow, someone's data from these groups leaks:
\begin{itemize}
\item By malicious actors\ldots{}
\item By Facebook itself\ldots{}
\item By users themselves\ldots{}
\end{itemize}
\end{itemize}

\subsubsection{What are the possible effects of these attacks?}
\label{sec:org644a0a4}

\begin{enumerate}
\item Physical harm to users
\item Loss of trust in the platform (Facebook)
\end{enumerate}

\subsubsection{What are their resources of the attackers?}
\label{sec:org4722390}
Believe that attackers' resources are limited:

\begin{itemize}
\item Profiteers will only spend resources if the reward is worth it, so very little
\item Well-meaning users will spend little resources, or none if educated
\item Trolls will find an easier target to attack
\item Insurance companies are a question mark: lots of resources for high reward
\end{itemize}

\subsubsection{What are our resources?}
\label{sec:org3ac727d}
Surprisingly limited, in some cases:

\begin{itemize}
\item 3 engineers, no PM, and half a data scientist
\item No medical experiences
\end{itemize}

But surprisingly large:

\begin{itemize}
\item Multi-bullion dollar company
\item Dedicated security, misinformation, bullying, and illegal sales teams
\item Secret weapons: group admins and a direct line to Mark Zuckerberg
\end{itemize}

\subsubsection{What should we do?}
\label{sec:org899219b}
\begin{enumerate}
\item Align closely with the Groups team as a whole
\item Partner with dedicated teams
\item Build/own ONLY the things that the group specifically care about
\begin{enumerate}
\item Sellling => Illegal Sales Team
\item Misinformation => Misinformation Team
\item Bullying => Well-being Team
\item Privacy\ldots{} a point of focus
\end{enumerate}
\end{enumerate}

Hence, the first feature is allowing real-name users to post anonymously.
\end{document}
